#include "List3tuples.h"

int main()
{
	//定义一个稀疏数组A
	int A[10][9] = { {0,0,0,0,25,2,0,0,0},
					{23,0,0,0,5,2,0,0,0},
					{0,5,0,0,0,6,0,0,0},
					{0,0,0,0,0,0,0,0,0},
					{0,2,0,0,0,0,0,0,0},
					{0,0,0,0,0,0,9,0,0},
					{0,0,0,0,0,8,0,0,0},
					{1,0,0,2,0,0,0,0,0},
					{0,0,0,0,0,0,0,0,10},
					{0,0,20,0,0,0,0,0,0} };

	//定义一个三元组T与其转置TB
	TSMatrix T, TB;

	//将稀疏数组改为三元组表示
	CreateMat(T, A);

	//输出三元组
	DispMat(T);

	//求三元组指定位置的值
	int x;
	GetValue(T, x, 1, 4);
	cout << "A[1,4] = " << x << endl;

	//三元组赋值
	int e = 100;
	Value(T, e, 3, 3);

	//输出三元组
	DispMat(T);

	//求转置
	TranTat(T, TB);

	//输出转置
	DispMat(TB);
}